{"backend": "tensorflow", "config": {"layers": [{"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 4, "activation": "relu", "bias_regularizer": null, "batch_input_shape": [null, 4], "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 6, "trainable": true, "activation": "relu", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 3, "trainable": true, "activation": "softmax", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "class_name": "Sequential"}